CSI API ETABS v1
cLinkObj.SetSelected Method
 Sets the selected status for link objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSelected(
	string Name,
	bool Selected,
	eItemType ItemType = eItemType.Objects
)
Function SetSelected (
	Name As String,
	Selected As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Selected As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetSelected(Name,
	Selected, ItemType)
int SetSelected(
	String^ Name,
	bool Selected,
	eItemType ItemType = eItemType::Objects
)
abstract SetSelected :
        Name : string *
        Selected : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object or group, depending on the value of the ItemType item.
Selected
Type: System.Boolean
This item is True if the specified link object is selected; otherwise it is False.
ItemType (Optional)
Type: ETABSv1.eItemType
This is one of the items in the eItemType enumeration.
If this item is Objects, the selected status is set for the link object specified by the Name item.
If this item is Group, the selected status is set for all link objects in the group specified by the Name item.
If this item is SelectedObjects, the selected status is set for all selected link objects, and the Name item is ignored.
Return Value
Type: Int32
Returns zero if the selected status is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'set link object selected
       ret = SapModel.LinkObj.SetSelected("ALL", True, eItemType.Group)
   'update view
       ret = SapModel.View.RefreshView
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace